import { describe, it, expect, beforeAll } from "bun:test";
import { 部件字根, 默认退化配置 } from "../src/index.js";
import type { 原始字库, 字符, 部件 } from "../src/index.js";
import { 获取数据 } from "./index.js";

let 部件图形库: Map<字符, 部件>;
let 原始字库实例: 原始字库;

beforeAll(() => {
  ({ 部件图形库, 原始字库: 原始字库实例 } = 获取数据());
});

const 包含 = (字根: 部件, 部件: 部件​, indices: number[]) => {
  const 字根实例 = new 部件字根(原始字库实例.校验("一")!.character, 字根);
  expect(部件.生成二进制切片列表(字根实例, 默认退化配置)).toContain(部件.索引转二进制(indices));
};

const g = (字根字符串: string) => {
  const 字符实例 = 原始字库实例.校验(字根字符串)!.character;
  return 部件图形库.get(字符实例)!;
}

const h = (字根字符串: string) => {
  const 字符实例 = 原始字库实例.校验(字根字符串)!.character;
  const 部件 = 部件图形库.get(字符实例)!;
  return new 部件字根(字符实例, 部件);
}

interface 切片来源 {
  部件: 部件;
  索引: number[];
}

interface 切片系列 {
  字根: 部件;
  切片来源列表: 切片来源[];
}

const 检查全部切片来源 = (字根: 部件, 切片来源列表: 切片来源[]) => {
  for (const { 部件, 索引 } of 切片来源列表) {
    it(`确认「${部件}」包含「${字根}」`, () => 包含(字根, 部件, 索引));
  }
};

const 切片系列数据: 切片系列[] = [
  {
    字根: g(""),
    切片来源列表: [
      { 部件: g("彖"), 索引: [3, 4, 5, 6, 7, 8] },
      { 部件: g("豙"), 索引: [5, 6, 7, 8, 9, 10] },
      { 部件: g("豖"), 索引: [1, 2, 3, 4, 6, 7] },
      { 部件: g(""), 索引: [2, 3, 4, 5, 6, 7] },
      { 部件: g("㒸"), 索引: [3, 4, 5, 6, 7, 8] },
    ],
  },
  {
    字根: g(""),
    切片来源列表: [
      { 部件: g("承"), 索引: [5, 6, 7] },
      { 部件: g("永"), 索引: [2, 3, 4] },
      { 部件: g("氶"), 索引: [2, 3, 4] },
    ],
  },
  {
    字根: g(""),
    切片来源列表: [
      { 部件: g("免"), 索引: [0, 1, 2, 3, 4] },
      { 部件: g("兔"), 索引: [0, 1, 2, 3, 4] },
      { 部件: g("象"), 索引: [0, 1, 2, 3, 4] },
    ],
  },
  {
    字根: g(""),
    切片来源列表: [
      { 部件: g("毛"), 索引: [0, 1, 2] },
      { 部件: g("龵"), 索引: [0, 1, 2] },
      { 部件: g("手"), 索引: [0, 1, 2] },
    ],
  },
  {
    字根: g("氺"),
    切片来源列表: [{ 部件: g("隶"), 索引: [3, 4, 5, 6, 7] }],
  },
  {
    字根: g(""),
    切片来源列表: [{ 部件: g("艮"), 索引: [3, 4, 5] }],
  },
  {
    字根: g("大"),
    切片来源列表: [
      { 部件: g("天"), 索引: [1, 2, 3] },
      { 部件: g("夫"), 索引: [1, 2, 3] },
    ],
  },
  {
    字根: g("夫"),
    切片来源列表: [
      { 部件: g(""), 索引: [7, 8, 9, 10] },
    ],
  },
  {
    字根: g("山"),
    切片来源列表: [{ 部件: g("出"), 索引: [2, 3, 4] }],
  },
  {
    字根: g(""),
    切片来源列表: [
      { 部件: g("朱"), 索引: [0, 1, 2] },
      { 部件: g("午"), 索引: [0, 1, 2] },
      { 部件: g("牛"), 索引: [0, 1, 2] },
      { 部件: g("失"), 索引: [0, 1, 2] },
      { 部件: g("牜"), 索引: [0, 1, 3] },
      { 部件: g("矢"), 索引: [0, 1, 2] },
      { 部件: g("缶"), 索引: [0, 1, 2] },
      { 部件: g(""), 索引: [0, 1, 2] },
      { 部件: g(""), 索引: [0, 1, 2] },
      { 部件: g(""), 索引: [0, 1, 2] },
    ],
  },
  {
    字根: g(""),
    切片来源列表: [
      { 部件: g("气"), 索引: [0, 1, 2] },
      { 部件: g("生"), 索引: [0, 1, 2] },
      { 部件: g("年"), 索引: [0, 1, 2] },
    ],
  },
  {
    字根: g(""),
    切片来源列表: [
      { 部件: g("瓜"), 索引: [2, 3] },
      { 部件: g(""), 索引: [3, 4] },
    ],
  },
  {
    字根: g("鱼"),
    切片来源列表: [{ 部件: g(""), 索引: [0, 1, 2, 3, 4, 5, 6, 7] }],
  },
];

describe("二进制数和索引的相互转换", () => {
  let 术 = g("术");
  let 垂 = g("垂");

  it("索引转二进制", () => {
    expect(术.索引转二进制([0, 1, 3])).toBe(26);
  });

  it("二进制转索引", () => {
    expect(术.二进制转索引(19)).toEqual([0, 3, 4]);
  });

  it("确保双向转换的一致性", () => {
    const n = 垂.笔画数();
    const numbers = [...Array(1 << (n - 1)).keys()];
    for (const i of numbers) {
      expect(垂.索引转二进制(垂.二进制转索引(i))).toBe(i);
    }
  });
});

describe("退化函数：特殊情况", () => {
  it("多次出现的字根", () => {
    const 丰 = g("丰");
    const 十 = h("十");
    expect(丰.生成二进制切片列表(十, 默认退化配置)).toEqual([9, 5, 3]);
  });

  it("区分「土」和「士」", () => {
    const 土 = h("土");
    const 士 = h("士");
    const 王 = g("王");
    const 壬 = g("壬");
    expect(王.生成二进制切片列表(土, 默认退化配置)).toEqual([7]);
    expect(王.生成二进制切片列表(士, 默认退化配置)).toEqual([]);
    expect(壬.生成二进制切片列表(土, 默认退化配置)).toEqual([]);
    expect(壬.生成二进制切片列表(士, 默认退化配置)).toEqual([7]);
  });

  it("区分「未」和「末」", () => {
    const 未 = h("未");
    const 末 = h("末");
    const 朱 = g("朱");
    const 耒 = g("耒");
    expect(朱.生成二进制切片列表(未, 默认退化配置)).toEqual([31]);
    expect(耒.生成二进制切片列表(未, 默认退化配置)).toEqual([47, 31]);
    expect(朱.生成二进制切片列表(末, 默认退化配置)).toEqual([]);
    expect(耒.生成二进制切片列表(末, 默认退化配置)).toEqual([]);
  });

  it("区分「口」和「囗」", () => {
    const 口 = h("口");
    const 囗 = h("囗");
    const 中 = g("中");
    const 日 = g("日");
    expect(中.生成二进制切片列表(口, 默认退化配置)).toEqual([14]);
    expect(中.生成二进制切片列表(囗, 默认退化配置)).toEqual([]);
    expect(日.生成二进制切片列表(口, 默认退化配置)).toEqual([]);
    expect(日.生成二进制切片列表(囗, 默认退化配置)).toEqual([13]);
  });

  it("区分「木无十」和「全字头」", () => {
    const 木无十 = h("");
    const 全字头 = h("");
    const 朱 = g("朱");
    expect(朱.生成二进制切片列表(木无十, 默认退化配置)).toEqual([3]);
    expect(朱.生成二进制切片列表(全字头, 默认退化配置)).toEqual([]);
  });
});

describe("退化函数：一般情况", () => {
  for (const { 字根: 字根名, 切片来源列表 } of 切片系列数据) {
    检查全部切片来源(字根名, 切片来源列表);
  }
});
