import { describe, it, expect } from "vitest";
import { defaultDegenerator } from "../src/main";
import { 获取数据 } from ".";

const { 部件图形库 } = 获取数据();

describe("二进制数和索引的相互转换", () => {
  const 术 = 部件图形库.术!;
  const 垂 = 部件图形库.垂!;
  it("五个笔画的部件上将索引转二进制", () => {
    expect(术.索引转二进制([0, 1, 3])).toBe(26);
  });
  it("五个笔画的部件上将二进制转索引", () => {
    expect(术.二进制转索引(19)).toEqual([0, 3, 4]);
  });
  it("确保一致性", () => {
    const n = 垂.笔画数();
    const numbers = [...Array(1 << (n - 1)).keys()];
    for (const i of numbers) {
      expect(垂.索引转二进制(垂.二进制转索引(i))).toBe(i);
    }
  });
});

describe("退化函数：特殊情况", () => {
  it("should find multiple occurence of a root", () => {
    const { 丰, 十 } = 部件图形库;
    expect(丰!.生成二进制切片列表(十!, defaultDegenerator)).toEqual([
      9, 5, 3,
    ]);
  });

  it("区分「土」和「士」", () => {
    const { 土, 士, 王, 壬 } = 部件图形库;
    expect(王!.生成二进制切片列表(土!, defaultDegenerator)).toEqual([7]);
    expect(王!.生成二进制切片列表(士!, defaultDegenerator)).toEqual([]);
    expect(壬!.生成二进制切片列表(土!, defaultDegenerator)).toEqual([]);
    expect(壬!.生成二进制切片列表(士!, defaultDegenerator)).toEqual([7]);
  });

  it("区分「未」和「末」", () => {
    const { 未, 末, 朱, 耒 } = 部件图形库;
    expect(朱!.生成二进制切片列表(未!, defaultDegenerator)).toEqual([31]);
    expect(耒!.生成二进制切片列表(未!, defaultDegenerator)).toEqual([
      47, 31,
    ]);
    expect(朱!.生成二进制切片列表(末!, defaultDegenerator)).toEqual([]);
    expect(耒!.生成二进制切片列表(末!, defaultDegenerator)).toEqual([]);
  });

  it("区分「口」和「囗」", () => {
    const { 口, 囗, 中, 日 } = 部件图形库;
    expect(中!.生成二进制切片列表(口!, defaultDegenerator)).toEqual([14]);
    expect(中!.生成二进制切片列表(囗!, defaultDegenerator)).toEqual([]);
    expect(日!.生成二进制切片列表(口!, defaultDegenerator)).toEqual([]);
    expect(日!.生成二进制切片列表(囗!, defaultDegenerator)).toEqual([13]);
  });

  it("区分「木无十」和「全字头」", () => {
    const 木无十 = 部件图形库["\ue087"]!;
    const 全字头 = 部件图形库["\ue43d"]!;
    const { 朱 } = 部件图形库;
    expect(朱!.生成二进制切片列表(木无十!, defaultDegenerator)).toEqual([3]);
    expect(朱!.生成二进制切片列表(全字头!, defaultDegenerator)).toEqual([]);
  });
});

const 包含 = (字根名: string, 部件名: string, indices: number[]) => {
  const 字根 = 部件图形库[字根名]!;
  const 部件 = 部件图形库[部件名]!;
  expect(部件.生成二进制切片列表(字根, defaultDegenerator)).toContain(部件.索引转二进制(indices));
};

interface 切片来源 {
  部件名: string;
  索引: number[];
}

interface 切片系列 {
  字根名: string;
  切片来源列表: 切片来源[];
}

const 检查全部切片来源 = (字根名: string, 切片来源列表: 切片来源[]) => {
  for (const { 部件名, 索引 } of 切片来源列表) {
    it(`确认「${部件名}」包含「${字根名}」`, () => 包含(字根名, 部件名, 索引));
  }
};

const 切片系列数据: 切片系列[] = [
  {
    字根名: "\ue420",
    切片来源列表: [
      { 部件名: "彖", 索引: [3, 4, 5, 6, 7, 8] },
      { 部件名: "豙", 索引: [5, 6, 7, 8, 9, 10] },
      { 部件名: "豖", 索引: [1, 2, 3, 4, 6, 7] },
      { 部件名: "\ue0b3", 索引: [2, 3, 4, 5, 6, 7] },
      { 部件名: "㒸", 索引: [3, 4, 5, 6, 7, 8] },
    ],
  },
  {
    字根名: "\ue42c",
    切片来源列表: [
      { 部件名: "承", 索引: [5, 6, 7] },
      { 部件名: "永", 索引: [2, 3, 4] },
      { 部件名: "氶", 索引: [2, 3, 4] },
    ],
  },
  {
    字根名: "\ue010", // 免五,
    切片来源列表: [
      { 部件名: "免", 索引: [0, 1, 2, 3, 4] },
      { 部件名: "兔", 索引: [0, 1, 2, 3, 4] },
      { 部件名: "象", 索引: [0, 1, 2, 3, 4] },
    ],
  },
  {
    字根名: "\ue17d", // 毛三
    切片来源列表: [
      { 部件名: "毛", 索引: [0, 1, 2] },
      { 部件名: "龵", 索引: [0, 1, 2] },
      { 部件名: "手", 索引: [0, 1, 2] },
    ],
  },
  {
    字根名: "氺",
    切片来源列表: [{ 部件名: "隶", 索引: [3, 4, 5, 6, 7] }],
  },
  {
    字根名: "龰",
    切片来源列表: [{ 部件名: "疌", 索引: [4, 5, 6, 7] }],
  },
  {
    字根名: "大",
    切片来源列表: [
      { 部件名: "天", 索引: [1, 2, 3] },
      { 部件名: "夫", 索引: [1, 2, 3] },
    ],
  },
  {
    字根名: "夫",
    切片来源列表: [
      { 部件名: "\ue104", 索引: [7, 8, 9, 10] }, // 漢字边
    ],
  },
  {
    字根名: "山",
    切片来源列表: [{ 部件名: "出", 索引: [2, 3, 4] }],
  },
  {
    字根名: "\uE40F", // 朱三
    切片来源列表: [
      { 部件名: "朱", 索引: [0, 1, 2] },
      { 部件名: "午", 索引: [0, 1, 2] },
      { 部件名: "牛", 索引: [0, 1, 2] },
      { 部件名: "失", 索引: [0, 1, 2] },
      { 部件名: "牜", 索引: [0, 1, 3] },
      { 部件名: "矢", 索引: [0, 1, 2] },
      { 部件名: "缶", 索引: [0, 1, 2] },
      { 部件名: "\uE00F", 索引: [0, 1, 2] }, // 制字旁
      { 部件名: "\uE021", 索引: [0, 1, 2] }, // 卸字旁
      { 部件名: "\uE0B1", 索引: [0, 1, 2] }, // 舞字头
    ],
  },
  {
    字根名: "\uE0FF", // 气三
    切片来源列表: [
      { 部件名: "气", 索引: [0, 1, 2] },
      { 部件名: "生", 索引: [0, 1, 2] },
      { 部件名: "年", 索引: [0, 1, 2] },
    ],
  },
  {
    字根名: "\uE444", // 瓜字心
    切片来源列表: [
      { 部件名: "瓜", 索引: [2, 3] },
      { 部件名: "\uE01C", 索引: [3, 4] },
    ],
  },
  {
    字根名: "鱼",
    切片来源列表: [{ 部件名: "\uE9F0", 索引: [0, 1, 2, 3, 4, 5, 6, 7] }],
  },
];

describe("退化函数：一般情况", () => {
  for (const { 字根名, 切片来源列表 } of 切片系列数据) {
    检查全部切片来源(字根名, 切片来源列表);
  }
});
